In [635]:
import pandas as pd

**Pandas Series Vs Pandas DataFrame**

*Indexes are created in Series*

*Indexes and Column are created in DataFrame*

In [638]:
ser1=pd.Series([11,22,33,44,55])
ser1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [640]:
df1=pd.DataFrame([11,22,33,44,55])
df1

    0
0  11
1  22
2  33
3  44
4  55

**Pandas DataFrame can be created using**

List

Nested List

Dictionary

Numpy Array

Series

**DataFrame using Python List**

In [644]:
df=pd.DataFrame([11,22,33,44,55])
df

    0
0  11
1  22
2  33
3  44
4  55

**DataFrame from Nested List**

In [647]:
df=pd.DataFrame([['Eng',98],['Maths',90],['Science',88],['Hindi',50]])
df

         0   1
0      Eng  98
1    Maths  90
2  Science  88
3    Hindi  50

**DataFrame from Python Dictionary**

In [650]:
dict1={'Name':['Raj','Ram','Sham','Tom'],
      'Marks':[10,20,30,40]}
dict1

{'Name': ['Raj', 'Ram', 'Sham', 'Tom'], 'Marks': [10, 20, 30, 40]}

In [652]:
df=pd.DataFrame(dict1)
df

   Name  Marks
0   Raj     10
1   Ram     20
2  Sham     30
3   Tom     40

In [654]:
df=pd.DataFrame({'Name':['Raj','Ram','Sham','Tom'],
      'Marks':[10,20,30,40]})
df

   Name  Marks
0   Raj     10
1   Ram     20
2  Sham     30
3   Tom     40

**DataFrame using Numpy**

In [657]:
import numpy as np
data=np.array([[1,2,3],[4,5,6],[7,8,9]])
data

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [659]:
df=pd.DataFrame(data,index=[1,2,3], columns=['a','b','c'])
df

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [661]:
df1 = pd.DataFrame(np.arange(1,26).reshape(5,5))
df1

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [663]:
df1 = pd.DataFrame(np.arange(1,26).reshape(5,5),index=list('ABCDE'))
df1

    0   1   2   3   4
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

**DataFrame using Series**

In [666]:
d={'First':pd.Series(['a','b','c','d','e']),
   'Second':pd.Series([1,2,3,4,5])
 }
d

{'First': 0    a
 1    b
 2    c
 3    d
 4    e
 dtype: object,
 'Second': 0    1
 1    2
 2    3
 3    4
 4    5
 dtype: int64}

In [668]:
df=pd.DataFrame(d)
df

  First  Second
0     a       1
1     b       2
2     c       3
3     d       4
4     e       5

In [670]:
df=pd.DataFrame({'First':pd.Series(['A','B','C','D','E']),
                 'Second':pd.Series([11,22,33,44,55])
})
df

  First  Second
0     A      11
1     B      22
2     C      33
3     D      44
4     E      55

**DataFrame from Dictionary with index**

In [673]:
dict1={'Name':['Saquib','Rafeeq','Sandeep','Tony'],
      'Marks':[34,36,37,44]}
dict1
#df=pd.Data

{'Name': ['Saquib', 'Rafeeq', 'Sandeep', 'Tony'], 'Marks': [34, 36, 37, 44]}

In [675]:
df=pd.DataFrame(dict1, index=[5,10,15,20])
df

       Name  Marks
5    Saquib     34
10   Rafeeq     36
15  Sandeep     37
20     Tony     44

In [677]:
df=pd.DataFrame({'Name':pd.Series(['Saquib','Rafeeq','Ram','Laxman']),
                 'Age':pd.Series([10,20,30,40])
})
df

     Name  Age
0  Saquib   10
1  Rafeeq   20
2     Ram   30
3  Laxman   40

**DataFrame from Dictionary with Datatype**

In [680]:
dict1={'ID':[50,60,70,80],
       'Age':[33,44,55,66]
}
dict1

{'ID': [50, 60, 70, 80], 'Age': [33, 44, 55, 66]}

In [682]:
type(dict1)

dict

In [684]:
df=pd.DataFrame(dict1,columns=['ID','Age'],
               index=['A','B','C','D'],
               dtype='float')
df.dtypes
df

     ID   Age
A  50.0  33.0
B  60.0  44.0
C  70.0  55.0
D  80.0  66.0

In [686]:
df=pd.DataFrame({'Name':pd.Series(['Saquib','Rafeeq','Ram','Laxman']),
                 'Age':pd.Series([10,20,30,40], dtype='float')
})
df.dtypes

Name     object
Age     float64
dtype: object

**Viewing - Inspecting Data**

In [689]:
dict1={'Name':['John','Maria','Shweta','Ram','Abdul','George'],
       'Marks':[88,77,55,77,55,77],
}
dict1

{'Name': ['John', 'Maria', 'Shweta', 'Ram', 'Abdul', 'George'],
 'Marks': [88, 77, 55, 77, 55, 77]}

In [691]:
df1=pd.DataFrame(dict1,index=['s1','s2','s3','s4','s5','s6'])
df1

      Name  Marks
s1    John     88
s2   Maria     77
s3  Shweta     55
s4     Ram     77
s5   Abdul     55
s6  George     77

In [693]:
df1.shape

(6, 2)

In [695]:
df1.head()

      Name  Marks
s1    John     88
s2   Maria     77
s3  Shweta     55
s4     Ram     77
s5   Abdul     55

In [697]:
df1.tail()

      Name  Marks
s2   Maria     77
s3  Shweta     55
s4     Ram     77
s5   Abdul     55
s6  George     77

In [699]:
df1.columns

Index(['Name', 'Marks'], dtype='object')

In [701]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, s1 to s6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

In [703]:
df1.Name

s1      John
s2     Maria
s3    Shweta
s4       Ram
s5     Abdul
s6    George
Name: Name, dtype: object

In [705]:
df1['Name']

s1      John
s2     Maria
s3    Shweta
s4       Ram
s5     Abdul
s6    George
Name: Name, dtype: object

In [707]:
df1[['Name','Marks']]

      Name  Marks
s1    John     88
s2   Maria     77
s3  Shweta     55
s4     Ram     77
s5   Abdul     55
s6  George     77

In [709]:
df1[0:2]

     Name  Marks
s1   John     88
s2  Maria     77

In [711]:
df1.iloc[0]

Name     John
Marks      88
Name: s1, dtype: object

In [713]:
df1['Marks'].max()

88

In [715]:
df1['Marks'].min()

55

In [717]:
df1['Marks'].mean()

71.5

In [719]:
df1.describe()

           Marks
count   6.000000
mean   71.500000
std    13.472194
min    55.000000
25%    60.500000
50%    77.000000
75%    77.000000
max    88.000000

In [721]:
df1['Marks'].value_counts()

Marks
77    3
55    2
88    1
Name: count, dtype: int64

In [723]:
df1['Marks'].count() #count of non null values

6

**Bracket[] vs dot(.) for selection**

In [726]:
dict1={'Name':['John','Maria','Shweta','Ram','Abdul','George'],
       'Marks':[88,77,55,77,55,77],
}
df1=pd.DataFrame(dict1,index=['s1','s2','s3','s4','s5','s6'])
df1

      Name  Marks
s1    John     88
s2   Maria     77
s3  Shweta     55
s4     Ram     77
s5   Abdul     55
s6  George     77

In [728]:
df1['Name']

s1      John
s2     Maria
s3    Shweta
s4       Ram
s5     Abdul
s6    George
Name: Name, dtype: object

In [730]:
df1.Name

s1      John
s2     Maria
s3    Shweta
s4       Ram
s5     Abdul
s6    George
Name: Name, dtype: object

In [732]:
dict1={'Student Name':['John','Maria','Shweta','Ram','Abdul','George'],
       'Marks':[88,77,55,77,55,77],
}
df1=pd.DataFrame(dict1,index=['s1','s2','s3','s4','s5','s6'])
df1

   Student Name  Marks
s1         John     88
s2        Maria     77
s3       Shweta     55
s4          Ram     77
s5        Abdul     55
s6       George     77

In [734]:
df1['Student Name']

s1      John
s2     Maria
s3    Shweta
s4       Ram
s5     Abdul
s6    George
Name: Student Name, dtype: object

In [740]:
df1.Student Name

## This is a valid error as there is space in the student name column

SyntaxError: invalid syntax (3429232589.py, line 1)

In [742]:
df1[['Student Name','Marks']] # dot not possible

   Student Name  Marks
s1         John     88
s2        Maria     77
s3       Shweta     55
s4          Ram     77
s5        Abdul     55
s6       George     77

In [744]:
dict1={'shape':['Square','Circle','Triangle','Rectangle'],
       'head':[1,2,3,4],
}
df2=pd.DataFrame(dict1)
df2

       shape  head
0     Square     1
1     Circle     2
2   Triangle     3
3  Rectangle     4

In [746]:
df2.shape

(4, 2)

In [748]:
df2.head

<bound method NDFrame.head of        shape  head
0     Square     1
1     Circle     2
2   Triangle     3
3  Rectangle     4>

In [750]:
df2['shape']

0       Square
1       Circle
2     Triangle
3    Rectangle
Name: shape, dtype: object

In [752]:
df2['head']

0    1
1    2
2    3
3    4
Name: head, dtype: int64

**loc vs iloc**

In [755]:
dict1={'Student Name':['John','Maria','Shweta','Ram','Abdul','George','Deepti','Rahul','Rosy'],
       'Marks':[88,77,55,77,55,77,34,56,42],
       'grades':['A','B','C','B','C','B','F','C','D']
}
df1=pd.DataFrame(dict1,index=['s1','s2','s3','s4','s5','s6','s7','s8','s9'])
df1

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C
s4          Ram     77      B
s5        Abdul     55      C
s6       George     77      B
s7       Deepti     34      F
s8        Rahul     56      C
s9         Rosy     42      D

In [757]:
df1.loc['s1',:]

Student Name    John
Marks             88
grades             A
Name: s1, dtype: object

In [759]:
df1.loc[['s1','s2','s3'],:]

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C

In [761]:
df1.loc['s1':'s4',:]

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C
s4          Ram     77      B

In [763]:
df1.loc[:,'Student Name']

s1      John
s2     Maria
s3    Shweta
s4       Ram
s5     Abdul
s6    George
s7    Deepti
s8     Rahul
s9      Rosy
Name: Student Name, dtype: object

In [765]:
df1.loc[:,['Student Name','Marks']]

   Student Name  Marks
s1         John     88
s2        Maria     77
s3       Shweta     55
s4          Ram     77
s5        Abdul     55
s6       George     77
s7       Deepti     34
s8        Rahul     56
s9         Rosy     42

In [767]:
df1.loc[:,'Student Name':]

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C
s4          Ram     77      B
s5        Abdul     55      C
s6       George     77      B
s7       Deepti     34      F
s8        Rahul     56      C
s9         Rosy     42      D

In [769]:
df1.iloc[:,:3]

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C
s4          Ram     77      B
s5        Abdul     55      C
s6       George     77      B
s7       Deepti     34      F
s8        Rahul     56      C
s9         Rosy     42      D

In [771]:
df1.iloc[:,0]

s1      John
s2     Maria
s3    Shweta
s4       Ram
s5     Abdul
s6    George
s7    Deepti
s8     Rahul
s9      Rosy
Name: Student Name, dtype: object

In [773]:
df1.iloc[:,0:2]

   Student Name  Marks
s1         John     88
s2        Maria     77
s3       Shweta     55
s4          Ram     77
s5        Abdul     55
s6       George     77
s7       Deepti     34
s8        Rahul     56
s9         Rosy     42

**loc, iloc, iat, at**

In [776]:
df1

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C
s4          Ram     77      B
s5        Abdul     55      C
s6       George     77      B
s7       Deepti     34      F
s8        Rahul     56      C
s9         Rosy     42      D

In [778]:
df1.iat[0,1]

88

In [780]:
df1.iat[4,0]

'Abdul'

In [782]:
df1.iat[4,0]=99

In [784]:
df1

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C
s4          Ram     77      B
s5           99     55      C
s6       George     77      B
s7       Deepti     34      F
s8        Rahul     56      C
s9         Rosy     42      D

In [786]:
df1.at['s1','Marks']

88

**loc and iloc with Boolean array**

In [789]:
df1

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C
s4          Ram     77      B
s5           99     55      C
s6       George     77      B
s7       Deepti     34      F
s8        Rahul     56      C
s9         Rosy     42      D

In [795]:
df1

   Student Name  Marks grades
s1         John     88      A
s2        Maria     77      B
s3       Shweta     55      C
s4          Ram     77      B
s5           99     55      C
s6       George     77      B
s7       Deepti     34      F
s8        Rahul     56      C
s9         Rosy     42      D

In [797]:
df1.loc[[True,False,True, False,True,False,True,True,False],[True,False,True]]

   Student Name grades
s1         John      A
s3       Shweta      C
s5           99      C
s7       Deepti      F
s8        Rahul      C

In [799]:
df1.iloc[[True,False,True, False,True,False,True,True,False],[True,False,True]]

   Student Name grades
s1         John      A
s3       Shweta      C
s5           99      C
s7       Deepti      F
s8        Rahul      C

In [802]:
df1 = pd.DataFrame(np.arange(1,26).reshape(5,5),index=list('ABCDE'),columns=list('UVWXY'))

In [804]:
df1

    U   V   W   X   Y
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15
D  16  17  18  19  20
E  21  22  23  24  25

In [806]:
df1.rename({'A':'Alpha'})

        U   V   W   X   Y
Alpha   1   2   3   4   5
B       6   7   8   9  10
C      11  12  13  14  15
D      16  17  18  19  20
E      21  22  23  24  25

In [808]:
df1.rename({'A':'Alpha'},axis=0)

        U   V   W   X   Y
Alpha   1   2   3   4   5
B       6   7   8   9  10
C      11  12  13  14  15
D      16  17  18  19  20
E      21  22  23  24  25

In [810]:
df1.rename({'U':'UUUU'},axis=1)

   UUUU   V   W   X   Y
A     1   2   3   4   5
B     6   7   8   9  10
C    11  12  13  14  15
D    16  17  18  19  20
E    21  22  23  24  25

In [812]:
ser1 = pd.Series(np.arange(1,11),index=list('ABCDEFGHIJ'))

In [814]:
ser1.replace({5:500})

A      1
B      2
C      3
D      4
E    500
F      6
G      7
H      8
I      9
J     10
dtype: int32